Nocterra-Consulting/MegaCore/avr/boards.txt
2560.menu.clock.2MHz_external=External 2 MHz
2560.menu.clock.2MHz_external.upload.speed=9600
2560.menu.clock.2MHz_external.bootloader.low_fuses=0xf7
2560.menu.clock.2MHz_external.build.clkpr=
2560.menu.clock.2MHz_external.build.f_cpu=2000000L

2560.menu.clock.1_8432MHz_external=External 1.8432 MHz
2560.menu.clock.1_8432MHz_external.upload.speed=115200
2560.menu.clock.1_8432MHz_external.bootloader.low_fuses=0xf7
2560.menu.clock.1_8432MHz_external.build.clkpr=
2560.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

2560.menu.clock.1MHz_external=External 1 MHz
2560.menu.clock.1MHz_external.upload.speed=9600
2560.menu.clock.1MHz_external.bootloader.low_fuses=0xf7
2560.menu.clock.1MHz_external.build.clkpr=
2560.menu.clock.1MHz_external.build.f_cpu=1000000L

2560.menu.clock.8MHz_internal=Internal 8 MHz
2560.menu.clock.8MHz_internal.upload.speed=38400
2560.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
2560.menu.clock.8MHz_internal.build.clkpr=
2560.menu.clock.8MHz_internal.build.f_cpu=8000000L

2560.menu.clock.4MHz_internal=Internal 4 MHz
2560.menu.clock.4MHz_internal.upload.speed=9600
2560.menu.clock.4MHz_internal.bootloader.low_fuses=0xe2
2560.menu.clock.4MHz_internal.build.clkpr=-DOSC_PRESCALER=0x01
2560.menu.clock.4MHz_internal.build.f_cpu=4000000L

2560.menu.clock.2MHz_internal=Internal 2 MHz
2560.menu.clock.2MHz_internal.upload.speed=9600
2560.menu.clock.2MHz_internal.bootloader.low_fuses=0xe2
2560.menu.clock.2MHz_internal.build.clkpr=-DOSC_PRESCALER=0x02
2560.menu.clock.2MHz_internal.build.f_cpu=2000000L

2560.menu.clock.1MHz_internal=Internal 1 MHz
2560.menu.clock.1MHz_internal.upload.speed=9600
2560.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
2560.menu.clock.1MHz_internal.build.clkpr=
2560.menu.clock.1MHz_internal.build.f_cpu=1000000L



#####################
#### ATmega1281  ####
#####################

# General
1281.name=ATmega1281
1281.upload.tool=avrdude
1281.upload.maximum_data_size=8192
1281.bootloader.tool=avrdude
1281.bootloader.unlock_bits=0xff
1281.bootloader.lock_bits=0xff
1281.build.core=MCUdude_corefiles
1281.build.variant=64-pin-avr
1281.build.board=AVR_ATmega1281
1281.build.mcu=atmega1281
1281.build.bootloader_led=led+b5
1281.build.extra_flags={build.clkpr}

# Upload port select
1281.menu.bootloader.uart0=Yes (UART0)
1281.menu.bootloader.uart0.upload.maximum_size=130560
1281.menu.bootloader.uart0.upload.protocol=urclock
1281.menu.bootloader.uart0.upload.uartpins=uart0_rxe0_txe1
1281.menu.bootloader.uart0.build.export_merged_output=true
1281.menu.bootloader.uart0.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

1281.menu.bootloader.uart1=Yes (UART1)
1281.menu.bootloader.uart1.upload.maximum_size=130560
1281.menu.bootloader.uart1.upload.protocol=urclock
1281.menu.bootloader.uart1.upload.uartpins=uart1_rxd2_txd3
1281.menu.bootloader.uart1.build.export_merged_output=true
1281.menu.bootloader.uart1.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

1281.menu.bootloader.no_bootloader=No bootloader
1281.menu.bootloader.no_bootloader.upload.maximum_size=131072
1281.menu.bootloader.no_bootloader.build.export_merged_output=false
1281.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
1281.menu.eeprom.keep=EEPROM retained
1281.menu.eeprom.keep.bootloader.high_fuses=0xd7
1281.menu.eeprom.erase=EEPROM not retained
1281.menu.eeprom.erase.bootloader.high_fuses=0xdf

# Brown out detection
1281.menu.BOD.2v7=BOD 2.7V
1281.menu.BOD.2v7.bootloader.extended_fuses=0xfd
1281.menu.BOD.4v3=BOD 4.3V
1281.menu.BOD.4v3.bootloader.extended_fuses=0xfc
1281.menu.BOD.1v8=BOD 1.8V
1281.menu.BOD.1v8.bootloader.extended_fuses=0xfe
1281.menu.BOD.disabled=BOD disabled
1281.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
1281.menu.LTO.Os_flto=LTO enabled
1281.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
1281.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
1281.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
1281.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

1281.menu.LTO.Os=LTO disabled
1281.menu.LTO.Os.compiler.c.extra_flags=
1281.menu.LTO.Os.compiler.c.elf.extra_flags=
1281.menu.LTO.Os.compiler.cpp.extra_flags=
1281.menu.LTO.Os.ltoarcmd=avr-ar

# Clock frequencies
1281.menu.clock.16MHz_external=External 16 MHz
1281.menu.clock.16MHz_external.upload.speed=115200
1281.menu.clock.16MHz_external.bootloader.low_fuses=0xf7
1281.menu.clock.16MHz_external.build.clkpr=
1281.menu.clock.16MHz_external.build.f_cpu=16000000L

1281.menu.clock.20MHz_external=External 20 MHz
1281.menu.clock.20MHz_external.upload.speed=115200
1281.menu.clock.20MHz_external.bootloader.low_fuses=0xf7
1281.menu.clock.20MHz_external.build.clkpr=
1281.menu.clock.20MHz_external.build.f_cpu=20000000L

1281.menu.clock.18_432MHz_external=External 18.4320 MHz
1281.menu.clock.18_432MHz_external.upload.speed=115200
1281.menu.clock.18_432MHz_external.bootloader.low_fuses=0xf7
1281.menu.clock.18_432MHz_external.build.clkpr=
1281.menu.clock.18_432MHz_external.build.f_cpu=18432000L

1281.menu.clock.14_7456MHz_external=External 14.7456 MHz
1281.menu.clock.14_7456MHz_external.upload.speed=115200
1281.menu.clock.14_7456MHz_external.bootloader.low_fuses=0xf7
1281.menu.clock.14_7456MHz_external.build.clkpr=
1281.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

1281.menu.clock.12MHz_external=External 12 MHz
1281.menu.clock.12MHz_external.upload.speed=57600
1281.menu.clock.12MHz_external.bootloader.low_fuses=0xf7
1281.menu.clock.12MHz_external.build.clkpr=
1281.menu.clock.12MHz_external.build.f_cpu=12000000L

1281.menu.clock.11_0592MHz_external=External 11.0592 MHz
1281.menu.clock.11_0592MHz_external.upload.speed=115200
1281.menu.clock.11_0592MHz_external.bootloader.low_fuses=0xf7
1281.menu.clock.11_0592MHz_external.build.clkpr=
1281.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

1281.menu.clock.8MHz_external=External 8 MHz
1281.menu.clock.8MHz_external.upload.speed=57600
1281.menu.clock.8MHz_external.bootloader.low_fuses=0xf7
1281.menu.clock.8MHz_external.build.clkpr=
1281.menu.clock.8MHz_external.build.f_cpu=8000000L

1281.menu.clock.7_3728MHz_external=External 7.3728 MHz
1281.menu.clock.7_3728MHz_external.upload.speed=115200
1281.menu.clock.7_3728MHz_external.bootloader.low_fuses=0xf7
1281.menu.clock.7_3728MHz_external.build.clkpr=
1281.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

