Nocterra-Consulting/MegaCore/avr/boards.txt
1280.menu.clock.14_7456MHz_external=External 14.7456 MHz
1280.menu.clock.14_7456MHz_external.upload.speed=115200
1280.menu.clock.14_7456MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.14_7456MHz_external.build.clkpr=
1280.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

1280.menu.clock.12MHz_external=External 12 MHz
1280.menu.clock.12MHz_external.upload.speed=57600
1280.menu.clock.12MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.12MHz_external.build.clkpr=
1280.menu.clock.12MHz_external.build.f_cpu=12000000L

1280.menu.clock.11_0592MHz_external=External 11.0592 MHz
1280.menu.clock.11_0592MHz_external.upload.speed=115200
1280.menu.clock.11_0592MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.11_0592MHz_external.build.clkpr=
1280.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

1280.menu.clock.8MHz_external=External 8 MHz
1280.menu.clock.8MHz_external.upload.speed=57600
1280.menu.clock.8MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.8MHz_external.build.clkpr=
1280.menu.clock.8MHz_external.build.f_cpu=8000000L

1280.menu.clock.7_3728MHz_external=External 7.3728 MHz
1280.menu.clock.7_3728MHz_external.upload.speed=115200
1280.menu.clock.7_3728MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.7_3728MHz_external.build.clkpr=
1280.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

1280.menu.clock.4MHz_external=External 4 MHz
1280.menu.clock.4MHz_external.upload.speed=9600
1280.menu.clock.4MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.4MHz_external.build.clkpr=
1280.menu.clock.4MHz_external.build.f_cpu=4000000L

1280.menu.clock.3_6864MHz_external=External 3.6864 MHz
1280.menu.clock.3_6864MHz_external.upload.speed=115200
1280.menu.clock.3_6864MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.3_6864MHz_external.build.clkpr=
1280.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

1280.menu.clock.2MHz_external=External 2 MHz
1280.menu.clock.2MHz_external.upload.speed=9600
1280.menu.clock.2MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.2MHz_external.build.clkpr=
1280.menu.clock.2MHz_external.build.f_cpu=2000000L

1280.menu.clock.1_8432MHz_external=External 1.8432 MHz
1280.menu.clock.1_8432MHz_external.upload.speed=115200
1280.menu.clock.1_8432MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.1_8432MHz_external.build.clkpr=
1280.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

1280.menu.clock.1MHz_external=External 1 MHz
1280.menu.clock.1MHz_external.upload.speed=9600
1280.menu.clock.1MHz_external.bootloader.low_fuses=0xf7
1280.menu.clock.1MHz_external.build.clkpr=
1280.menu.clock.1MHz_external.build.f_cpu=1000000L

1280.menu.clock.8MHz_internal=Internal 8 MHz
1280.menu.clock.8MHz_internal.upload.speed=38400
1280.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
1280.menu.clock.8MHz_internal.build.clkpr=
1280.menu.clock.8MHz_internal.build.f_cpu=8000000L

1280.menu.clock.4MHz_internal=Internal 4 MHz
1280.menu.clock.4MHz_internal.upload.speed=9600
1280.menu.clock.4MHz_internal.bootloader.low_fuses=0xe2
1280.menu.clock.4MHz_internal.build.clkpr=-DOSC_PRESCALER=0x01
1280.menu.clock.4MHz_internal.build.f_cpu=4000000L

1280.menu.clock.2MHz_internal=Internal 2 MHz
1280.menu.clock.2MHz_internal.upload.speed=9600
1280.menu.clock.2MHz_internal.bootloader.low_fuses=0xe2
1280.menu.clock.2MHz_internal.build.clkpr=-DOSC_PRESCALER=0x02
1280.menu.clock.2MHz_internal.build.f_cpu=2000000L

1280.menu.clock.1MHz_internal=Internal 1 MHz
1280.menu.clock.1MHz_internal.upload.speed=9600
1280.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
1280.menu.clock.1MHz_internal.build.clkpr=
1280.menu.clock.1MHz_internal.build.f_cpu=1000000L



##########################
####  ATmega649/6490  ####
##########################

# General
649.name=ATmega649/6490
649.upload.tool=avrdude
649.upload.maximum_data_size=4096
649.bootloader.tool=avrdude
649.bootloader.unlock_bits=0xff
649.bootloader.lock_bits=0xff
649.build.core=MCUdude_corefiles
649.build.board=AVR_ATmega649
649.build.extra_flags={build.clkpr}

# Upload port select
649.menu.bootloader.uart0=Yes (UART0)
649.menu.bootloader.uart0.upload.maximum_size=65024
649.menu.bootloader.uart0.upload.protocol=urclock
649.menu.bootloader.uart0.upload.uartpins=uart0_rxe0_txe1
649.menu.bootloader.uart0.build.export_merged_output=true
649.menu.bootloader.uart0.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

649.menu.bootloader.no_bootloader=No bootloader
649.menu.bootloader.no_bootloader.upload.maximum_size=65536
649.menu.bootloader.no_bootloader.build.export_merged_output=false
649.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
649.menu.eeprom.keep=EEPROM retained
649.menu.eeprom.keep.bootloader.high_fuses=0xd7
649.menu.eeprom.erase=EEPROM not retained
649.menu.eeprom.erase.bootloader.high_fuses=0xdf

# Variants
649.menu.variant.model649P=649P/PA
649.menu.variant.model649P.build.mcu=atmega649p
649.menu.variant.model649P.build.variant=64-pin-avr
649.menu.variant.model649P.build.board=AVR_ATmega649
649.menu.variant.model649P.build.bootloader_led=led+b5

649.menu.variant.model649=649/A
649.menu.variant.model649.build.mcu=atmega649
649.menu.variant.model649.build.variant=64-pin-avr
649.menu.variant.model649.build.board=AVR_ATmega649
649.menu.variant.model649.build.bootloader_led=led+b5

649.menu.variant.model6490P=6490P/PA
649.menu.variant.model6490P.build.mcu=atmega6490p
649.menu.variant.model6490P.build.variant=100-pin-avr
649.menu.variant.model6490P.build.board=AVR_ATmega6490
649.menu.variant.model6490P.build.bootloader_led=led+b7

649.menu.variant.model6490=6490/A
649.menu.variant.model6490.build.mcu=atmega6490
649.menu.variant.model6490.build.variant=100-pin-avr
649.menu.variant.model6490.build.board=AVR_ATmega6490
649.menu.variant.model6490.build.bootloader_led=led+b7

# Brown out detection
649.menu.BOD.2v7=BOD 2.7V
649.menu.BOD.2v7.bootloader.extended_fuses=0xfb
649.menu.BOD.4v3=BOD 4.3V
649.menu.BOD.4v3.bootloader.extended_fuses=0xf9
649.menu.BOD.1v8=BOD 1.8V
649.menu.BOD.1v8.bootloader.extended_fuses=0xfd
649.menu.BOD.disabled=BOD disabled
649.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
649.menu.LTO.Os_flto=LTO enabled
649.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
649.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
649.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
649.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

649.menu.LTO.Os=LTO disabled
649.menu.LTO.Os.compiler.c.extra_flags=
649.menu.LTO.Os.compiler.c.elf.extra_flags=
649.menu.LTO.Os.compiler.cpp.extra_flags=
649.menu.LTO.Os.ltoarcmd=avr-ar

