Nocterra-Consulting/MegaCore/avr/boards.txt
# Clock frequencies
649.menu.clock.16MHz_external=External 16 MHz
649.menu.clock.16MHz_external.upload.speed=115200
649.menu.clock.16MHz_external.bootloader.low_fuses=0xff
649.menu.clock.16MHz_external.build.clkpr=
649.menu.clock.16MHz_external.build.f_cpu=16000000L

649.menu.clock.20MHz_external=External 20 MHz
649.menu.clock.20MHz_external.upload.speed=115200
649.menu.clock.20MHz_external.bootloader.low_fuses=0xff
649.menu.clock.20MHz_external.build.clkpr=
649.menu.clock.20MHz_external.build.f_cpu=20000000L

649.menu.clock.18_432MHz_external=External 18.4320 MHz
649.menu.clock.18_432MHz_external.upload.speed=115200
649.menu.clock.18_432MHz_external.bootloader.low_fuses=0xff
649.menu.clock.18_432MHz_external.build.clkpr=
649.menu.clock.18_432MHz_external.build.f_cpu=18432000L

649.menu.clock.14_7456MHz_external=External 14.7456 MHz
649.menu.clock.14_7456MHz_external.upload.speed=115200
649.menu.clock.14_7456MHz_external.bootloader.low_fuses=0xff
649.menu.clock.14_7456MHz_external.build.clkpr=
649.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

649.menu.clock.12MHz_external=External 12 MHz
649.menu.clock.12MHz_external.upload.speed=57600
649.menu.clock.12MHz_external.bootloader.low_fuses=0xff
649.menu.clock.12MHz_external.build.clkpr=
649.menu.clock.12MHz_external.build.f_cpu=12000000L

649.menu.clock.11_0592MHz_external=External 11.0592 MHz
649.menu.clock.11_0592MHz_external.upload.speed=115200
649.menu.clock.11_0592MHz_external.bootloader.low_fuses=0xff
649.menu.clock.11_0592MHz_external.build.clkpr=
649.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

649.menu.clock.8MHz_external=External 8 MHz
649.menu.clock.8MHz_external.upload.speed=57600
649.menu.clock.8MHz_external.bootloader.low_fuses=0xff
649.menu.clock.8MHz_external.build.clkpr=
649.menu.clock.8MHz_external.build.f_cpu=8000000L

649.menu.clock.7_3728MHz_external=External 7.3728 MHz
649.menu.clock.7_3728MHz_external.upload.speed=115200
649.menu.clock.7_3728MHz_external.bootloader.low_fuses=0xff
649.menu.clock.7_3728MHz_external.build.clkpr=
649.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

649.menu.clock.4MHz_external=External 4 MHz
649.menu.clock.4MHz_external.upload.speed=9600
649.menu.clock.4MHz_external.bootloader.low_fuses=0xff
649.menu.clock.4MHz_external.build.clkpr=
649.menu.clock.4MHz_external.build.f_cpu=4000000L

649.menu.clock.3_6864MHz_external=External 3.6864 MHz
649.menu.clock.3_6864MHz_external.upload.speed=115200
649.menu.clock.3_6864MHz_external.bootloader.low_fuses=0xff
649.menu.clock.3_6864MHz_external.build.clkpr=
649.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

649.menu.clock.2MHz_external=External 2 MHz
649.menu.clock.2MHz_external.upload.speed=9600
649.menu.clock.2MHz_external.bootloader.low_fuses=0xff
649.menu.clock.2MHz_external.build.clkpr=
649.menu.clock.2MHz_external.build.f_cpu=2000000L

649.menu.clock.1_8432MHz_external=External 1.8432 MHz
649.menu.clock.1_8432MHz_external.upload.speed=115200
649.menu.clock.1_8432MHz_external.bootloader.low_fuses=0xff
649.menu.clock.1_8432MHz_external.build.clkpr=
649.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

649.menu.clock.1MHz_external=External 1 MHz
649.menu.clock.1MHz_external.upload.speed=9600
649.menu.clock.1MHz_external.bootloader.low_fuses=0xff
649.menu.clock.1MHz_external.build.clkpr=
649.menu.clock.1MHz_external.build.f_cpu=1000000L

649.menu.clock.8MHz_internal=Internal 8 MHz
649.menu.clock.8MHz_internal.upload.speed=38400
649.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
649.menu.clock.8MHz_internal.build.clkpr=
649.menu.clock.8MHz_internal.build.f_cpu=8000000L

649.menu.clock.4MHz_internal=Internal 4 MHz
649.menu.clock.4MHz_internal.upload.speed=9600
649.menu.clock.4MHz_internal.bootloader.low_fuses=0xe2
649.menu.clock.4MHz_internal.build.clkpr=-DOSC_PRESCALER=0x01
649.menu.clock.4MHz_internal.build.f_cpu=4000000L

649.menu.clock.2MHz_internal=Internal 2 MHz
649.menu.clock.2MHz_internal.upload.speed=9600
649.menu.clock.2MHz_internal.bootloader.low_fuses=0xe2
649.menu.clock.2MHz_internal.build.clkpr=-DOSC_PRESCALER=0x02
649.menu.clock.2MHz_internal.build.f_cpu=2000000L

649.menu.clock.1MHz_internal=Internal 1 MHz
649.menu.clock.1MHz_internal.upload.speed=9600
649.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
649.menu.clock.1MHz_internal.build.clkpr=
649.menu.clock.1MHz_internal.build.f_cpu=1000000L



##########################
####  ATmega645/6450  ####
##########################

# General
645.name=ATmega645/6450
645.upload.tool=avrdude
645.upload.maximum_data_size=4096
645.bootloader.tool=avrdude
645.bootloader.unlock_bits=0xff
645.bootloader.lock_bits=0xff
645.build.core=MCUdude_corefiles
645.build.board=AVR_ATmega645
645.build.extra_flags={build.clkpr}

# Upload port select
645.menu.bootloader.uart0=Yes (UART0)
645.menu.bootloader.uart0.upload.maximum_size=65024
645.menu.bootloader.uart0.upload.protocol=urclock
645.menu.bootloader.uart0.upload.uartpins=uart0_rxe0_txe1
645.menu.bootloader.uart0.build.export_merged_output=true
645.menu.bootloader.uart0.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

645.menu.bootloader.no_bootloader=No bootloader
645.menu.bootloader.no_bootloader.upload.maximum_size=65536
645.menu.bootloader.no_bootloader.build.export_merged_output=false
645.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
645.menu.eeprom.keep=EEPROM retained
645.menu.eeprom.keep.bootloader.high_fuses=0xd7
645.menu.eeprom.erase=EEPROM not retained
645.menu.eeprom.erase.bootloader.high_fuses=0xdf

# Variants
645.menu.variant.model645P=645P/PA
645.menu.variant.model645P.build.mcu=atmega645p
645.menu.variant.model645P.build.variant=64-pin-avr
645.menu.variant.model645P.build.board=AVR_ATmega645
645.menu.variant.model645P.build.bootloader_led=led+b5

645.menu.variant.model645=645/A
645.menu.variant.model645.build.mcu=atmega645
645.menu.variant.model645.build.variant=64-pin-avr
645.menu.variant.model645.build.board=AVR_ATmega645
645.menu.variant.model645.build.bootloader_led=led+b5

