Nocterra-Consulting/MegaCore/avr/boards.txt
645.menu.variant.model6450P=6450P
645.menu.variant.model6450P.build.mcu=atmega6450p
645.menu.variant.model6450P.build.variant=100-pin-avr
645.menu.variant.model6450P.build.board=AVR_ATmega6450
645.menu.variant.model6450P.build.bootloader_led=led+b7

645.menu.variant.model6450=6450/A
645.menu.variant.model6450.build.mcu=atmega6450
645.menu.variant.model6450.build.variant=100-pin-avr
645.menu.variant.model6450.build.board=AVR_ATmega6450
645.menu.variant.model6450.build.bootloader_led=led+b7

# Brown out detection
645.menu.BOD.2v7=BOD 2.7V
645.menu.BOD.2v7.bootloader.extended_fuses=0xfb
645.menu.BOD.4v3=BOD 4.3V
645.menu.BOD.4v3.bootloader.extended_fuses=0xf9
645.menu.BOD.1v8=BOD 1.8V
645.menu.BOD.1v8.bootloader.extended_fuses=0xfd
645.menu.BOD.disabled=BOD disabled
645.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
645.menu.LTO.Os_flto=LTO enabled
645.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
645.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
645.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
645.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

645.menu.LTO.Os=LTO disabled
645.menu.LTO.Os.compiler.c.extra_flags=
645.menu.LTO.Os.compiler.c.elf.extra_flags=
645.menu.LTO.Os.compiler.cpp.extra_flags=
645.menu.LTO.Os.ltoarcmd=avr-ar

# Clock frequencies
645.menu.clock.16MHz_external=External 16 MHz
645.menu.clock.16MHz_external.upload.speed=115200
645.menu.clock.16MHz_external.bootloader.low_fuses=0xff
645.menu.clock.16MHz_external.build.clkpr=
645.menu.clock.16MHz_external.build.f_cpu=16000000L

645.menu.clock.20MHz_external=External 20 MHz
645.menu.clock.20MHz_external.upload.speed=115200
645.menu.clock.20MHz_external.bootloader.low_fuses=0xff
645.menu.clock.20MHz_external.build.clkpr=
645.menu.clock.20MHz_external.build.f_cpu=20000000L

645.menu.clock.18_432MHz_external=External 18.4320 MHz
645.menu.clock.18_432MHz_external.upload.speed=115200
645.menu.clock.18_432MHz_external.bootloader.low_fuses=0xff
645.menu.clock.18_432MHz_external.build.clkpr=
645.menu.clock.18_432MHz_external.build.f_cpu=18432000L

645.menu.clock.14_7456MHz_external=External 14.7456 MHz
645.menu.clock.14_7456MHz_external.upload.speed=115200
645.menu.clock.14_7456MHz_external.bootloader.low_fuses=0xff
645.menu.clock.14_7456MHz_external.build.clkpr=
645.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

645.menu.clock.12MHz_external=External 12 MHz
645.menu.clock.12MHz_external.upload.speed=57600
645.menu.clock.12MHz_external.bootloader.low_fuses=0xff
645.menu.clock.12MHz_external.build.clkpr=
645.menu.clock.12MHz_external.build.f_cpu=12000000L

645.menu.clock.11_0592MHz_external=External 11.0592 MHz
645.menu.clock.11_0592MHz_external.upload.speed=115200
645.menu.clock.11_0592MHz_external.bootloader.low_fuses=0xff
645.menu.clock.11_0592MHz_external.build.clkpr=
645.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

645.menu.clock.8MHz_external=External 8 MHz
645.menu.clock.8MHz_external.upload.speed=57600
645.menu.clock.8MHz_external.bootloader.low_fuses=0xff
645.menu.clock.8MHz_external.build.clkpr=
645.menu.clock.8MHz_external.build.f_cpu=8000000L

645.menu.clock.7_3728MHz_external=External 7.3728 MHz
645.menu.clock.7_3728MHz_external.upload.speed=115200
645.menu.clock.7_3728MHz_external.bootloader.low_fuses=0xff
645.menu.clock.7_3728MHz_external.build.clkpr=
645.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

645.menu.clock.4MHz_external=External 4 MHz
645.menu.clock.4MHz_external.upload.speed=9600
645.menu.clock.4MHz_external.bootloader.low_fuses=0xff
645.menu.clock.4MHz_external.build.clkpr=
645.menu.clock.4MHz_external.build.f_cpu=4000000L

645.menu.clock.3_6864MHz_external=External 3.6864 MHz
645.menu.clock.3_6864MHz_external.upload.speed=115200
645.menu.clock.3_6864MHz_external.bootloader.low_fuses=0xff
645.menu.clock.3_6864MHz_external.build.clkpr=
645.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

645.menu.clock.2MHz_external=External 2 MHz
645.menu.clock.2MHz_external.upload.speed=9600
645.menu.clock.2MHz_external.bootloader.low_fuses=0xff
645.menu.clock.2MHz_external.build.clkpr=
645.menu.clock.2MHz_external.build.f_cpu=2000000L

645.menu.clock.1_8432MHz_external=External 1.8432 MHz
645.menu.clock.1_8432MHz_external.upload.speed=115200
645.menu.clock.1_8432MHz_external.bootloader.low_fuses=0xff
645.menu.clock.1_8432MHz_external.build.clkpr=
645.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

645.menu.clock.1MHz_external=External 1 MHz
645.menu.clock.1MHz_external.upload.speed=9600
645.menu.clock.1MHz_external.bootloader.low_fuses=0xff
645.menu.clock.1MHz_external.build.clkpr=
645.menu.clock.1MHz_external.build.f_cpu=1000000L

645.menu.clock.8MHz_internal=Internal 8 MHz
645.menu.clock.8MHz_internal.upload.speed=38400
645.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
645.menu.clock.8MHz_internal.build.clkpr=
645.menu.clock.8MHz_internal.build.f_cpu=8000000L

645.menu.clock.4MHz_internal=Internal 4 MHz
645.menu.clock.4MHz_internal.upload.speed=9600
645.menu.clock.4MHz_internal.bootloader.low_fuses=0xe2
645.menu.clock.4MHz_internal.build.clkpr=-DOSC_PRESCALER=0x01
645.menu.clock.4MHz_internal.build.f_cpu=4000000L

645.menu.clock.2MHz_internal=Internal 2 MHz
645.menu.clock.2MHz_internal.upload.speed=9600
645.menu.clock.2MHz_internal.bootloader.low_fuses=0xe2
645.menu.clock.2MHz_internal.build.clkpr=-DOSC_PRESCALER=0x02
645.menu.clock.2MHz_internal.build.f_cpu=2000000L

645.menu.clock.1MHz_internal=Internal 1 MHz
645.menu.clock.1MHz_internal.upload.speed=9600
645.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
645.menu.clock.1MHz_internal.build.clkpr=
645.menu.clock.1MHz_internal.build.f_cpu=1000000L



#####################
#### ATmega640  ####
#####################

# General
640.name=ATmega640
640.upload.tool=avrdude
640.upload.maximum_data_size=8192
640.bootloader.tool=avrdude
640.bootloader.unlock_bits=0xff
640.bootloader.lock_bits=0xff
640.build.core=MCUdude_corefiles
640.build.board=AVR_ATmega640
640.build.mcu=atmega640
640.build.bootloader_led=led+b7
640.build.extra_flags={build.clkpr}

# Upload port select
640.menu.bootloader.uart0=Yes (UART0)
640.menu.bootloader.uart0.upload.maximum_size=65024
640.menu.bootloader.uart0.upload.protocol=urclock
640.menu.bootloader.uart0.upload.uartpins=uart0_rxe0_txe1
640.menu.bootloader.uart0.build.export_merged_output=true
640.menu.bootloader.uart0.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

640.menu.bootloader.uart1=Yes (UART1)
640.menu.bootloader.uart1.upload.maximum_size=65024
640.menu.bootloader.uart1.upload.protocol=urclock
640.menu.bootloader.uart1.upload.uartpins=uart1_rxd2_txd3
640.menu.bootloader.uart1.build.export_merged_output=true
640.menu.bootloader.uart1.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

640.menu.bootloader.uart2=Yes (UART2)
640.menu.bootloader.uart2.upload.maximum_size=65024
640.menu.bootloader.uart2.upload.protocol=urclock
640.menu.bootloader.uart2.upload.uartpins=uart2_rxh0_txh1
640.menu.bootloader.uart2.build.export_merged_output=true
640.menu.bootloader.uart2.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

640.menu.bootloader.uart3=Yes (UART3)
640.menu.bootloader.uart3.upload.maximum_size=65024
640.menu.bootloader.uart3.upload.protocol=urclock
640.menu.bootloader.uart3.upload.uartpins=uart3_rxj0_txj1
640.menu.bootloader.uart3.build.export_merged_output=true
640.menu.bootloader.uart3.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

640.menu.bootloader.no_bootloader=No bootloader
640.menu.bootloader.no_bootloader.upload.maximum_size=65536
640.menu.bootloader.no_bootloader.build.export_merged_output=false
640.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
640.menu.eeprom.keep=EEPROM retained
640.menu.eeprom.keep.bootloader.high_fuses=0xd7
640.menu.eeprom.erase=EEPROM not retained
640.menu.eeprom.erase.bootloader.high_fuses=0xdf

# Pinouts
640.menu.pinout.mega_pinout=Arduino MEGA pinout
640.menu.pinout.mega_pinout.build.variant=100-pin-arduino-mega
640.menu.pinout.avr_pinout=AVR pinout
640.menu.pinout.avr_pinout.build.variant=100-pin-avr

# Brown out detection
640.menu.BOD.2v7=BOD 2.7V
640.menu.BOD.2v7.bootloader.extended_fuses=0xfd
640.menu.BOD.4v3=BOD 4.3V
640.menu.BOD.4v3.bootloader.extended_fuses=0xfc
640.menu.BOD.1v8=BOD 1.8V
640.menu.BOD.1v8.bootloader.extended_fuses=0xfe
640.menu.BOD.disabled=BOD disabled
640.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
640.menu.LTO.Os_flto=LTO enabled
640.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
640.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
640.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
640.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

640.menu.LTO.Os=LTO disabled
640.menu.LTO.Os.compiler.c.extra_flags=
640.menu.LTO.Os.compiler.c.elf.extra_flags=
640.menu.LTO.Os.compiler.cpp.extra_flags=
640.menu.LTO.Os.ltoarcmd=avr-ar

