Nocterra-Consulting/MegaCore/avr/boards.txt
# Clock frequencies
640.menu.clock.16MHz_external=External 16 MHz
640.menu.clock.16MHz_external.upload.speed=115200
640.menu.clock.16MHz_external.bootloader.low_fuses=0xf7
640.menu.clock.16MHz_external.build.clkpr=
640.menu.clock.16MHz_external.build.f_cpu=16000000L

640.menu.clock.20MHz_external=External 20 MHz
640.menu.clock.20MHz_external.upload.speed=115200
640.menu.clock.20MHz_external.bootloader.low_fuses=0xf7
640.menu.clock.20MHz_external.build.clkpr=
640.menu.clock.20MHz_external.build.f_cpu=20000000L

640.menu.clock.18_432MHz_external=External 18.4320 MHz
640.menu.clock.18_432MHz_external.upload.speed=115200
640.menu.clock.18_432MHz_external.bootloader.low_fuses=0xf7
640.menu.clock.18_432MHz_external.build.clkpr=
640.menu.clock.18_432MHz_external.build.f_cpu=18432000L

640.menu.clock.14_7456MHz_external=External 14.7456 MHz
640.menu.clock.14_7456MHz_external.upload.speed=115200
640.menu.clock.14_7456MHz_external.bootloader.low_fuses=0xf7
640.menu.clock.14_7456MHz_external.build.clkpr=
640.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

640.menu.clock.12MHz_external=External 12 MHz
640.menu.clock.12MHz_external.upload.speed=57600
640.menu.clock.12MHz_external.bootloader.low_fuses=0xf7
640.menu.clock.12MHz_external.build.clkpr=
640.menu.clock.12MHz_external.build.f_cpu=12000000L

640.menu.clock.11_0592MHz_external=External 11.0592 MHz
640.menu.clock.11_0592MHz_external.upload.speed=115200
640.menu.clock.11_0592MHz_external.bootloader.low_fuses=0xf7
640.menu.clock.11_0592MHz_external.build.clkpr=
640.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

640.menu.clock.8MHz_external=External 8 MHz
640.menu.clock.8MHz_external.upload.speed=57600
640.menu.clock.8MHz_external.bootloader.low_fuses=0xf7
640.menu.clock.8MHz_external.build.clkpr=
640.menu.clock.8MHz_external.build.f_cpu=8000000L

640.menu.clock.7_3728MHz_external=External 7.3728 MHz
640.menu.clock.7_3728MHz_external.upload.speed=115200
640.menu.clock.7_3728MHz_external.bootloader.low_fuses=0xf7
640.menu.clock.7_3728MHz_external.build.clkpr=
640.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

640.menu.clock.4MHz_external=External 4 MHz
640.menu.clock.4MHz_external.upload.speed=9600
640.menu.clock.4MHz_external.bootloader.low_fuses=0xf7
640.menu.clock.4MHz_external.build.clkpr=
640.menu.clock.4MHz_external.build.f_cpu=4000000L

640.menu.clock.3_6864MHz_external=External 3.6864 MHz
640.menu.clock.3_6864MHz_external.upload.speed=115200
640.menu.clock.3_6864MHz_external.bootloader.low_fuses=0xf7
640.menu.clock.3_6864MHz_external.build.clkpr=
640.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

640.menu.clock.2MHz_external=External 2 MHz
640.menu.clock.2MHz_external.upload.speed=9600
640.menu.clock.2MHz_external.bootloader.low_fuses=0xf7
640.menu.clock.2MHz_external.build.clkpr=
640.menu.clock.2MHz_external.build.f_cpu=2000000L

640.menu.clock.1_8432MHz_external=External 1.8432 MHz
640.menu.clock.1_8432MHz_external.upload.speed=115200
640.menu.clock.1_8432MHz_external.bootloader.low_fuses=0xf7
640.menu.clock.1_8432MHz_external.build.clkpr=
640.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

640.menu.clock.1MHz_external=External 1 MHz
640.menu.clock.1MHz_external.upload.speed=9600
640.menu.clock.1MHz_external.bootloader.low_fuses=0xf7
640.menu.clock.1MHz_external.build.clkpr=
640.menu.clock.1MHz_external.build.f_cpu=1000000L

640.menu.clock.8MHz_internal=Internal 8 MHz
640.menu.clock.8MHz_internal.upload.speed=38400
640.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
640.menu.clock.8MHz_internal.build.clkpr=
640.menu.clock.8MHz_internal.build.f_cpu=8000000L

640.menu.clock.4MHz_internal=Internal 4 MHz
640.menu.clock.4MHz_internal.upload.speed=9600
640.menu.clock.4MHz_internal.bootloader.low_fuses=0xe2
640.menu.clock.4MHz_internal.build.clkpr=-DOSC_PRESCALER=0x01
640.menu.clock.4MHz_internal.build.f_cpu=4000000L

640.menu.clock.2MHz_internal=Internal 2 MHz
640.menu.clock.2MHz_internal.upload.speed=9600
640.menu.clock.2MHz_internal.bootloader.low_fuses=0xe2
640.menu.clock.2MHz_internal.build.clkpr=-DOSC_PRESCALER=0x02
640.menu.clock.2MHz_internal.build.f_cpu=2000000L

640.menu.clock.1MHz_internal=Internal 1 MHz
640.menu.clock.1MHz_internal.upload.speed=9600
640.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
640.menu.clock.1MHz_internal.build.clkpr=
640.menu.clock.1MHz_internal.build.f_cpu=1000000L



##########################
####  ATmega329/3290  ####
##########################

# General
329.name=ATmega329/3290
329.upload.tool=avrdude
329.upload.maximum_data_size=2048
329.bootloader.tool=avrdude
329.bootloader.unlock_bits=0xff
329.bootloader.lock_bits=0xff
329.build.core=MCUdude_corefiles
329.build.board=AVR_ATmega329
329.build.extra_flags={build.clkpr}

# Upload port select
329.menu.bootloader.uart0=Yes (UART0)
329.menu.bootloader.uart0.upload.maximum_size=32384
329.menu.bootloader.uart0.upload.protocol=urclock
329.menu.bootloader.uart0.upload.uartpins=uart0_rxe0_txe1
329.menu.bootloader.uart0.build.export_merged_output=true
329.menu.bootloader.uart0.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

329.menu.bootloader.no_bootloader=No bootloader
329.menu.bootloader.no_bootloader.upload.maximum_size=32768
329.menu.bootloader.no_bootloader.build.export_merged_output=false
329.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
329.menu.eeprom.keep=EEPROM retained
329.menu.eeprom.keep.bootloader.high_fuses=0xd7
329.menu.eeprom.erase=EEPROM not retained
329.menu.eeprom.erase.bootloader.high_fuses=0xdf

# Variants
329.menu.variant.model329P=329P/PA
329.menu.variant.model329P.build.mcu=atmega329p
329.menu.variant.model329P.build.variant=64-pin-avr
329.menu.variant.model329P.build.board=AVR_ATmega329
329.menu.variant.model329P.build.bootloader_led=led+b5

329.menu.variant.model329=329/A
329.menu.variant.model329.build.mcu=atmega329
329.menu.variant.model329.build.variant=64-pin-avr
329.menu.variant.model329.build.board=AVR_ATmega329
329.menu.variant.model329.build.bootloader_led=led+b5

329.menu.variant.model3290P=3290P/PA
329.menu.variant.model3290P.build.mcu=atmega3290p
329.menu.variant.model3290P.build.variant=100-pin-avr
329.menu.variant.model3290P.build.board=AVR_ATmega3290
329.menu.variant.model3290P.build.bootloader_led=led+b7

329.menu.variant.model3290=3290/A
329.menu.variant.model3290.build.mcu=atmega3290
329.menu.variant.model3290.build.variant=100-pin-avr
329.menu.variant.model3290.build.board=AVR_ATmega3290
329.menu.variant.model3290.build.bootloader_led=led+b7

# Brown out detection
329.menu.BOD.2v7=BOD 2.7V
329.menu.BOD.2v7.bootloader.extended_fuses=0xfb
329.menu.BOD.4v3=BOD 4.3V
329.menu.BOD.4v3.bootloader.extended_fuses=0xf9
329.menu.BOD.1v8=BOD 1.8V
329.menu.BOD.1v8.bootloader.extended_fuses=0xfd
329.menu.BOD.disabled=BOD disabled
329.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
329.menu.LTO.Os_flto=LTO enabled
329.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
329.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
329.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
329.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

