Nocterra-Consulting/MegaCore/avr/boards.txt
# Clock frequencies
165.menu.clock.16MHz_external=External 16 MHz
165.menu.clock.16MHz_external.upload.speed=115200
165.menu.clock.16MHz_external.bootloader.low_fuses=0xff
165.menu.clock.16MHz_external.build.clkpr=
165.menu.clock.16MHz_external.build.f_cpu=16000000L

165.menu.clock.20MHz_external=External 20 MHz
165.menu.clock.20MHz_external.upload.speed=115200
165.menu.clock.20MHz_external.bootloader.low_fuses=0xff
165.menu.clock.20MHz_external.build.clkpr=
165.menu.clock.20MHz_external.build.f_cpu=20000000L

165.menu.clock.18_432MHz_external=External 18.4320 MHz
165.menu.clock.18_432MHz_external.upload.speed=115200
165.menu.clock.18_432MHz_external.bootloader.low_fuses=0xff
165.menu.clock.18_432MHz_external.build.clkpr=
165.menu.clock.18_432MHz_external.build.f_cpu=18432000L

165.menu.clock.14_7456MHz_external=External 14.7456 MHz
165.menu.clock.14_7456MHz_external.upload.speed=115200
165.menu.clock.14_7456MHz_external.bootloader.low_fuses=0xff
165.menu.clock.14_7456MHz_external.build.clkpr=
165.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

165.menu.clock.12MHz_external=External 12 MHz
165.menu.clock.12MHz_external.upload.speed=57600
165.menu.clock.12MHz_external.bootloader.low_fuses=0xff
165.menu.clock.12MHz_external.build.clkpr=
165.menu.clock.12MHz_external.build.f_cpu=12000000L

165.menu.clock.11_0592MHz_external=External 11.0592 MHz
165.menu.clock.11_0592MHz_external.upload.speed=115200
165.menu.clock.11_0592MHz_external.bootloader.low_fuses=0xff
165.menu.clock.11_0592MHz_external.build.clkpr=
165.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

165.menu.clock.8MHz_external=External 8 MHz
165.menu.clock.8MHz_external.upload.speed=57600
165.menu.clock.8MHz_external.bootloader.low_fuses=0xff
165.menu.clock.8MHz_external.build.clkpr=
165.menu.clock.8MHz_external.build.f_cpu=8000000L

165.menu.clock.7_3728MHz_external=External 7.3728 MHz
165.menu.clock.7_3728MHz_external.upload.speed=115200
165.menu.clock.7_3728MHz_external.bootloader.low_fuses=0xff
165.menu.clock.7_3728MHz_external.build.clkpr=
165.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

165.menu.clock.4MHz_external=External 4 MHz
165.menu.clock.4MHz_external.upload.speed=9600
165.menu.clock.4MHz_external.bootloader.low_fuses=0xff
165.menu.clock.4MHz_external.build.clkpr=
165.menu.clock.4MHz_external.build.f_cpu=4000000L

165.menu.clock.3_6864MHz_external=External 3.6864 MHz
165.menu.clock.3_6864MHz_external.upload.speed=115200
165.menu.clock.3_6864MHz_external.bootloader.low_fuses=0xff
165.menu.clock.3_6864MHz_external.build.clkpr=
165.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

165.menu.clock.2MHz_external=External 2 MHz
165.menu.clock.2MHz_external.upload.speed=9600
165.menu.clock.2MHz_external.bootloader.low_fuses=0xff
165.menu.clock.2MHz_external.build.clkpr=
165.menu.clock.2MHz_external.build.f_cpu=2000000L

165.menu.clock.1_8432MHz_external=External 1.8432 MHz
165.menu.clock.1_8432MHz_external.upload.speed=115200
165.menu.clock.1_8432MHz_external.bootloader.low_fuses=0xff
165.menu.clock.1_8432MHz_external.build.clkpr=
165.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

165.menu.clock.1MHz_external=External 1 MHz
165.menu.clock.1MHz_external.upload.speed=9600
165.menu.clock.1MHz_external.bootloader.low_fuses=0xff
165.menu.clock.1MHz_external.build.clkpr=
165.menu.clock.1MHz_external.build.f_cpu=1000000L

165.menu.clock.8MHz_internal=Internal 8 MHz
165.menu.clock.8MHz_internal.upload.speed=38400
165.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
165.menu.clock.8MHz_internal.build.clkpr=
165.menu.clock.8MHz_internal.build.f_cpu=8000000L

165.menu.clock.4MHz_internal=Internal 4 MHz
165.menu.clock.4MHz_internal.upload.speed=9600
165.menu.clock.4MHz_internal.bootloader.low_fuses=0xe2
165.menu.clock.4MHz_internal.build.clkpr=-DOSC_PRESCALER=0x01
165.menu.clock.4MHz_internal.build.f_cpu=4000000L

165.menu.clock.2MHz_internal=Internal 2 MHz
165.menu.clock.2MHz_internal.upload.speed=9600
165.menu.clock.2MHz_internal.bootloader.low_fuses=0xe2
165.menu.clock.2MHz_internal.build.clkpr=-DOSC_PRESCALER=0x02
165.menu.clock.2MHz_internal.build.f_cpu=2000000L

165.menu.clock.1MHz_internal=Internal 1 MHz
165.menu.clock.1MHz_internal.upload.speed=9600
165.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
165.menu.clock.1MHz_internal.build.clkpr=
165.menu.clock.1MHz_internal.build.f_cpu=1000000L



#####################
#### ATmega128/A ####
#####################

# General
128.name=ATmega128
128.upload.tool=avrdude
128.upload.maximum_data_size=4096
128.bootloader.tool=avrdude
128.bootloader.unlock_bits=0xff
128.bootloader.lock_bits=0xff
128.bootloader.low_fuses=0b{bootloader.bod_bits}{bootloader.sut_cksel_bits}
128.bootloader.high_fuses=0b110{bootloader.ckopt_bit}{bootloader.eesave_bit}111
128.bootloader.extended_fuses=0xff
128.build.core=MCUdude_corefiles
128.build.variant=64-pin-avr
128.build.board=AVR_ATmega128
128.build.mcu=atmega128
128.build.bootloader_led=led+b5

# Upload port select
128.menu.bootloader.uart0=Yes (UART0)
128.menu.bootloader.uart0.upload.maximum_size=130560
128.menu.bootloader.uart0.upload.protocol=urclock
128.menu.bootloader.uart0.upload.uartpins=uart0_rxe0_txe1
128.menu.bootloader.uart0.build.export_merged_output=true
128.menu.bootloader.uart0.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

128.menu.bootloader.uart1=Yes (UART1)
128.menu.bootloader.uart1.upload.maximum_size=130560
128.menu.bootloader.uart1.upload.protocol=urclock
128.menu.bootloader.uart1.upload.uartpins=uart1_rxd2_txd3
128.menu.bootloader.uart1.build.export_merged_output=true
128.menu.bootloader.uart1.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

128.menu.bootloader.no_bootloader=No bootloader
128.menu.bootloader.no_bootloader.upload.maximum_size=131072
128.menu.bootloader.no_bootloader.build.export_merged_output=false
128.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
128.menu.eeprom.keep=EEPROM retained
128.menu.eeprom.keep.bootloader.eesave_bit=0
128.menu.eeprom.erase=EEPROM not retained
128.menu.eeprom.erase.bootloader.eesave_bit=1

