Nocterra-Consulting/MegaCore/avr/boards.txt
can128.menu.bootloader.no_bootloader=No bootloader
can128.menu.bootloader.no_bootloader.upload.maximum_size=131072
can128.menu.bootloader.no_bootloader.build.export_merged_output=false
can128.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
can128.menu.eeprom.keep=EEPROM retained
can128.menu.eeprom.keep.bootloader.high_fuses=0xd7
can128.menu.eeprom.erase=EEPROM not retained
can128.menu.eeprom.erase.bootloader.high_fuses=0xdf

# Brown out detection
can128.menu.BOD.2v7=BOD 2.7V
can128.menu.BOD.2v7.bootloader.extended_fuses=0xf5
can128.menu.BOD.4v1=BOD 4.1V
can128.menu.BOD.4v1.bootloader.extended_fuses=0xfd
can128.menu.BOD.4v0=BOD 4.0V
can128.menu.BOD.4v0.bootloader.extended_fuses=0xfb
can128.menu.BOD.3v9=BOD 3.9V
can128.menu.BOD.3v9.bootloader.extended_fuses=0xf9
can128.menu.BOD.3v8=BOD 3.8V
can128.menu.BOD.3v8.bootloader.extended_fuses=0xf7
can128.menu.BOD.2v6=BOD 2.6V
can128.menu.BOD.2v6.bootloader.extended_fuses=0xf3
can128.menu.BOD.2v5=BOD 2.5V
can128.menu.BOD.2v5.bootloader.extended_fuses=0xf1
can128.menu.BOD.disabled=BOD disabled
can128.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
can128.menu.LTO.Os_flto=LTO enabled
can128.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
can128.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
can128.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
can128.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

can128.menu.LTO.Os=LTO disabled
can128.menu.LTO.Os.compiler.c.extra_flags=
can128.menu.LTO.Os.compiler.c.elf.extra_flags=
can128.menu.LTO.Os.compiler.cpp.extra_flags=
can128.menu.LTO.Os.ltoarcmd=avr-ar

# Clock frequencies
can128.menu.clock.16MHz_external=External 16 MHz
can128.menu.clock.16MHz_external.upload.speed=115200
can128.menu.clock.16MHz_external.bootloader.low_fuses=0xff
can128.menu.clock.16MHz_external.build.clkpr=
can128.menu.clock.16MHz_external.build.f_cpu=16000000L

can128.menu.clock.20MHz_external=External 20 MHz
can128.menu.clock.20MHz_external.upload.speed=115200
can128.menu.clock.20MHz_external.bootloader.low_fuses=0xff
can128.menu.clock.20MHz_external.build.clkpr=
can128.menu.clock.20MHz_external.build.f_cpu=20000000L

can128.menu.clock.18_432MHz_external=External 18.4320 MHz
can128.menu.clock.18_432MHz_external.upload.speed=115200
can128.menu.clock.18_432MHz_external.bootloader.low_fuses=0xff
can128.menu.clock.18_432MHz_external.build.clkpr=
can128.menu.clock.18_432MHz_external.build.f_cpu=18432000L

can128.menu.clock.14_7456MHz_external=External 14.7456 MHz
can128.menu.clock.14_7456MHz_external.upload.speed=115200
can128.menu.clock.14_7456MHz_external.bootloader.low_fuses=0xff
can128.menu.clock.14_7456MHz_external.build.clkpr=
can128.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

can128.menu.clock.12MHz_external=External 12 MHz
can128.menu.clock.12MHz_external.upload.speed=57600
can128.menu.clock.12MHz_external.bootloader.low_fuses=0xff
can128.menu.clock.12MHz_external.build.clkpr=
can128.menu.clock.12MHz_external.build.f_cpu=12000000L

can128.menu.clock.11_0592MHz_external=External 11.0592 MHz
can128.menu.clock.11_0592MHz_external.upload.speed=115200
can128.menu.clock.11_0592MHz_external.bootloader.low_fuses=0xff
can128.menu.clock.11_0592MHz_external.build.clkpr=
can128.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

can128.menu.clock.8MHz_external=External 8 MHz
can128.menu.clock.8MHz_external.upload.speed=57600
can128.menu.clock.8MHz_external.bootloader.low_fuses=0xff
can128.menu.clock.8MHz_external.build.clkpr=
can128.menu.clock.8MHz_external.build.f_cpu=8000000L

can128.menu.clock.7_3728MHz_external=External 7.3728 MHz
can128.menu.clock.7_3728MHz_external.upload.speed=115200
can128.menu.clock.7_3728MHz_external.bootloader.low_fuses=0xfd
can128.menu.clock.7_3728MHz_external.build.clkpr=
can128.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

can128.menu.clock.4MHz_external=External 4 MHz
can128.menu.clock.4MHz_external.upload.speed=9600
can128.menu.clock.4MHz_external.bootloader.low_fuses=0xfd
can128.menu.clock.4MHz_external.build.clkpr=
can128.menu.clock.4MHz_external.build.f_cpu=4000000L

can128.menu.clock.3_6864MHz_external=External 3.6864 MHz
can128.menu.clock.3_6864MHz_external.upload.speed=115200
can128.menu.clock.3_6864MHz_external.bootloader.low_fuses=0xfd
can128.menu.clock.3_6864MHz_external.build.clkpr=
can128.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

can128.menu.clock.2MHz_external=External 2 MHz
can128.menu.clock.2MHz_external.upload.speed=9600
can128.menu.clock.2MHz_external.bootloader.low_fuses=0xfb
can128.menu.clock.2MHz_external.build.clkpr=
can128.menu.clock.2MHz_external.build.f_cpu=2000000L

can128.menu.clock.1_8432MHz_external=External 1.8432 MHz
can128.menu.clock.1_8432MHz_external.upload.speed=115200
can128.menu.clock.1_8432MHz_external.bootloader.low_fuses=0xfb
can128.menu.clock.1_8432MHz_external.build.clkpr=
can128.menu.clock.1_8432MHz_external.build.f_cpu=1843200L

can128.menu.clock.1MHz_external=External 1 MHz
can128.menu.clock.1MHz_external.upload.speed=9600
can128.menu.clock.1MHz_external.bootloader.low_fuses=0xfb
can128.menu.clock.1MHz_external.build.clkpr=
can128.menu.clock.1MHz_external.build.f_cpu=1000000L

can128.menu.clock.8MHz_internal=Internal 8 MHz
can128.menu.clock.8MHz_internal.upload.speed=38400
can128.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
can128.menu.clock.8MHz_internal.build.clkpr=
can128.menu.clock.8MHz_internal.build.f_cpu=8000000L

can128.menu.clock.4MHz_internal=Internal 4 MHz
can128.menu.clock.4MHz_internal.upload.speed=9600
can128.menu.clock.4MHz_internal.bootloader.low_fuses=0xe2
can128.menu.clock.4MHz_internal.build.clkpr=-DOSC_PRESCALER=0x01
can128.menu.clock.4MHz_internal.build.f_cpu=4000000L

can128.menu.clock.2MHz_internal=Internal 2 MHz
can128.menu.clock.2MHz_internal.upload.speed=9600
can128.menu.clock.2MHz_internal.bootloader.low_fuses=0xe2
can128.menu.clock.2MHz_internal.build.clkpr=-DOSC_PRESCALER=0x02
can128.menu.clock.2MHz_internal.build.f_cpu=2000000L

can128.menu.clock.1MHz_internal=Internal 1 MHz
can128.menu.clock.1MHz_internal.upload.speed=9600
can128.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
can128.menu.clock.1MHz_internal.build.clkpr=
can128.menu.clock.1MHz_internal.build.f_cpu=1000000L



#####################
####  AT90CAN64  ####
#####################

# General
can64.name=AT90CAN64
can64.upload.tool=avrdude
can64.upload.maximum_data_size=4096
can64.bootloader.tool=avrdude
can64.bootloader.unlock_bits=0xff
can64.bootloader.lock_bits=0xff
can64.build.core=MCUdude_corefiles
can64.build.variant=64-pin-avr
can64.build.board=AVR_AT90CAN64
can64.build.mcu=at90can64
can64.build.bootloader_led=led+b5
can64.build.extra_flags={build.clkpr}

# Upload port select
can64.menu.bootloader.uart0=Yes (UART0)
can64.menu.bootloader.uart0.upload.maximum_size=65024
can64.menu.bootloader.uart0.upload.protocol=urclock
can64.menu.bootloader.uart0.upload.uartpins=uart0_rxe0_txe1
can64.menu.bootloader.uart0.build.export_merged_output=true
can64.menu.bootloader.uart0.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

can64.menu.bootloader.uart1=Yes (UART1)
can64.menu.bootloader.uart1.upload.maximum_size=65024
can64.menu.bootloader.uart1.upload.protocol=urclock
can64.menu.bootloader.uart1.upload.uartpins=uart1_rxd2_txd3
can64.menu.bootloader.uart1.build.export_merged_output=true
can64.menu.bootloader.uart1.bootloader.file=urboot/{build.mcu}/watchdog_1_s/autobaud/{upload.uartpins}/{build.bootloader_led}/urboot_{build.mcu}_pr_ee_ce.hex

can64.menu.bootloader.no_bootloader=No bootloader
can64.menu.bootloader.no_bootloader.upload.maximum_size=65536
can64.menu.bootloader.no_bootloader.build.export_merged_output=false
can64.menu.bootloader.no_bootloader.bootloader.file=empty/empty.hex

# EEPROM
can64.menu.eeprom.keep=EEPROM retained
can64.menu.eeprom.keep.bootloader.high_fuses=0xd7
can64.menu.eeprom.erase=EEPROM not retained
can64.menu.eeprom.erase.bootloader.high_fuses=0xdf

# Brown out detection
can64.menu.BOD.2v7=BOD 2.7V
can64.menu.BOD.2v7.bootloader.extended_fuses=0xf5
can64.menu.BOD.4v1=BOD 4.1V
can64.menu.BOD.4v1.bootloader.extended_fuses=0xfd
can64.menu.BOD.4v0=BOD 4.0V
can64.menu.BOD.4v0.bootloader.extended_fuses=0xfb
can64.menu.BOD.3v9=BOD 3.9V
can64.menu.BOD.3v9.bootloader.extended_fuses=0xf9
can64.menu.BOD.3v8=BOD 3.8V
can64.menu.BOD.3v8.bootloader.extended_fuses=0xf7
can64.menu.BOD.2v6=BOD 2.6V
can64.menu.BOD.2v6.bootloader.extended_fuses=0xf3
can64.menu.BOD.2v5=BOD 2.5V
can64.menu.BOD.2v5.bootloader.extended_fuses=0xf1
can64.menu.BOD.disabled=BOD disabled
can64.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
can64.menu.LTO.Os_flto=LTO enabled
can64.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto -g
can64.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto -g
can64.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto -g
can64.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

